# Напишіть цикл, який буде вимагати від користувача ввести слово, 
# в якому є літера "h" (враховуються як великі так і маленькі). 
# Цикл не повинен завершитися, якщо користувач ввів слово без букви "h".

LETER_H = 'h'
while True:
    input_data = input(f"Якщо хочете вийти із цикла, то введіть строку з літерою '{LETER_H}': ")
    print(f"Ви ввели строку: {input_data}")
    if LETER_H in input_data.lower():
        print(f"В строці знаходиться літера '{LETER_H}'")
        break
    else:
        print(f"В строці немає літери '{LETER_H}'")

